/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taebkim <taebkim@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/11/21 21:21:03 by taebkim           #+#    #+#             */
/*   Updated: 2024/11/21 21:26:28 by taebkim          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "philo.h"

int	main(void)
{
	/*
		각 철학자는 1부터 number_of_philosophers까지의 고유 번호를 가지고 있습니다.
	*/

	/*
		철학자 번호 1은 철학자 번호 number_of_philosophers의 옆에 앉습니다.
		그 외에 철학자 번호 N 은 철학자 번호 N - 1 과 철학자 번호 N + 1 사이에 앉습니다.
	*/

	return (0);
}